# Pandas `Series`

In [1]:
import pandas as pd
pd.Series?

Init signature:
pd.Series(
    data=None,
    index=None,
    dtype: 'Dtype | None' = None,
    name=None,
    copy: 'bool | None' = None,
    fastpath: 'bool | lib.NoDefault' = <no_default>,
) -> 'None'
Docstring:
One-dimensional ndarray with axis labels (including time series).

Labels need not be unique but must be a hashable type. The object
supports both integer- and label-based indexing and provides a host of
methods for performing operations involving the index. Statistical
methods from ndarray have been overridden to automatically exclude
missing data (currently represented as NaN).

Operations between Series (+, -, /, \*, \*\*) align values based on their
associated index values-- they need not be the same length. The result
index will be the sorted union of the two indexes.

Parameters
----------
data : array-like, Iterable, dict, or scalar value
    Contains data stored in Series. If data is a dict, argument order is
    maintained.
index : array-like or Index (1d)
    Values must be hashable and have the same length as `data`.
    Non-unique index values are allowed. Will default to
    RangeIndex (0, 1, 2, ..., n) if not provided. If data is dict-like
    and index is None, then the keys in the data are used as the index. If the
    index is not None, the resulting Series is reindexed with the index values.
dtype : str, numpy.dtype, or ExtensionDtype, optional
    Data type for the output Series. If not specified, this will be
    inferred from `data`.
    See the :ref:`user guide <basics.dtypes>` for more usages.
name : Hashable, default None
    The name to give to the Series.
copy : bool, default False
    Copy input data. Only affects Series or 1d ndarray input. See examples.

Notes
-----
Please reference the :ref:`User Guide <basics.series>` for more information.

Examples
--------
Constructing Series from a dictionary with an Index specified

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['a', 'b', 'c'])
>>> ser
a   1
b   2
c   3
dtype: int64

The keys of the dictionary match with the Index values, hence the Index
values have no effect.

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['x', 'y', 'z'])
>>> ser
x   NaN
y   NaN
z   NaN
dtype: float64

Note that the Index is first build with the keys from the dictionary.
After this the Series is reindexed with the given Index values, hence we
get all NaN as a result.

Constructing Series from a list with `copy=False`.

>>> r = [1, 2]
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
[1, 2]
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `copy` of
the original data even though `copy=False`, so
the data is unchanged.

Constructing Series from a 1d ndarray with `copy=False`.

>>> r = np.array([1, 2])
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
array([999,   2])
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `view` on
the original data, so
the data is changed as well.
File:           c:\users\rote\appdata\local\programs\python\python312\lib\site-packages\pandas\core\series.py
Type:           type
Subclasses:     SubclassedSeries

In [8]:
animals = ['Tiger','Bear','Moose']
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [6]:
numbers = [3,1,4]
pd.Series(numbers)

0    3
1    1
2    4
dtype: int64

In [9]:
animals = ['Tiger','Bear', None]
pd.Series(animals)

0    Tiger
1     Bear
2     None
dtype: object

In [21]:
numbers = [3, 1, None]
pd.Series(numbers)

RangeIndex(start=0, stop=3, step=1)

In [11]:
import numpy as np
np.nan == None

False

In [12]:
if(np.nan):
    print ('check')

check

In [13]:
np.nan == np.nan

False

In [14]:
np.isnan(np.nan)

True

In [16]:
numbers = [3,1,4,'Bear', None]
pd.Series(numbers)

0       3
1       1
2       4
3    Bear
4    None
dtype: object

In [18]:
np.isnan('hoi')

TypeError: ufunc 'isnan' not supported for the input types, and the inputs could not be safely coerced to any supported types according to the casting rule ''safe''

In [19]:
sports = {'Achery':'Bhutan',
         'Golf':'Scotland',
         'Sumo':'Japan',
         'Taekwondo':'South Korea'}
s = pd.Series(sports)
s

Achery            Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [20]:
s.index

Index(['Achery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [29]:
pd.Series(['Tiger','Bear','Moose'], index=['India','India', 1]).index

Index(['India', 'India', 1], dtype='object')

In [31]:
sports = {'Achery':'Bhutan',
         'Golf':'Scotland',
         'Sumo':'Japan',
         'Taekwondo':'South Korea'}
s = pd.Series(sports, index=['Golf','Sumo','Hockey'])
s

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

## Querying a `Series` object

In [32]:
sports = {'Achery':'Bhutan',
         'Golf':'Scotland',
         'Sumo':'Japan',
         'Taekwondo':'South Korea'}
s = pd.Series(sports)
s

Achery            Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [60]:
s.iloc[ [1,3] ]

Golf            Scotland
Taekwondo    South Korea
dtype: object

In [59]:
s.iloc[ 0:3 ]

Achery      Bhutan
Golf      Scotland
Sumo         Japan
dtype: object

In [62]:
s.loc[ ['Achery','Sumo'] ]

Achery    Bhutan
Sumo       Japan
dtype: object

In [71]:
s = pd.Series( data=[100, 120, 101, 3])
s

0    100
1    120
2    101
3      3
dtype: int64

In [74]:
%%timeit
sum(s)

940 ns ± 5.52 ns per loop (mean ± std. dev. of 7 runs, 1,000,000 loops each)

In [75]:
%%timeit
tot = 0
for i in s:
    tot += i
    
tot

997 ns ± 9.23 ns per loop (mean ± std. dev. of 7 runs, 1,000,000 loops each)

In [77]:
%%timeit
import numpy as np
tot = np.sum(s)
tot

16.4 µs ± 100 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [98]:
s = pd.Series(np.random.randint(0,1000,100))
s.head()

0    964
1    374
2    543
3    571
4    908
dtype: int64

In [79]:
len(s)

10000

In [84]:
%%timeit -n 100
tot = 0
for x in s:
    tot += x

    tot

700 µs ± 142 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [85]:
%%timeit -n 100
tot = np.sum(s)
tot

The slowest run took 4.08 times longer than the fastest. This could mean that an intermediate result is being cached.
60.7 µs ± 23.1 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [93]:
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])
all_countries = original_sports.append(cricket_loving_countries)
all_countries

/var/folders/sh/djdw6j_j1zbfpbcf7k2z77rc0000gp/T/ipykernel_22805/2265387507.py:13: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  all_countries = original_sports.append(cricket_loving_countries)

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [94]:
all_countries.loc['Cricket']

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [97]:
d = {'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'}
d['Archery'] = 'Groningen'
d

{'Archery': 'Groningen',
 'Golf': 'Scotland',
 'Sumo': 'Japan',
 'Taekwondo': 'South Korea'}

## The `DataFrame` type

In [127]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
purchase_4 = pd.Series({'Name': 'Karel',
                        'Item Purchased': 'Aston Martin',
                        'Cost': 97})

df = pd.DataFrame(data=[purchase_1, purchase_2, purchase_3, purchase_4], index=['Store 1', 'Store 2', 'Store 3', 'Store 4'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0
Store 4  Karel   Aston Martin  97.0

In [115]:
df.loc[ ['Store 1', 'Store 3'] ]

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 3  Vinod      Bird Seed   5.0

In [117]:
df.loc['Store 1']['Cost']

22.5

In [123]:
df.T

                 Store 1       Store 2    Store 3
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5        5.0

In [124]:
df.T.loc['Name']

Store 1    Chris
Store 2    Kevyn
Store 3    Vinod
Name: Name, dtype: object

In [130]:
df.shape

(4, 3)

In [136]:
arr = np.array( [[1,2,3], [2,4,6], [2,3,5], [1,3,5]] )
arr

array([[1, 2, 3],
       [2, 4, 6],
       [2, 3, 5],
       [1, 3, 5]])

In [138]:
arr.shape

(4, 3)

In [147]:
arr[0:2, :]

array([[1, 2, 3],
       [2, 4, 6]])

In [152]:
df.loc[['Store 1','Store 3'], ['Name', 'Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 3  Vinod   5.0

In [155]:
df.drop('Store 4')

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

In [160]:
df2 = df.copy()
df2.drop('Store 1', inplace=True)

In [162]:
df2

          Name Item Purchased  Cost
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0
Store 4  Karel   Aston Martin  97.0

In [166]:
df2.drop('Name', inplace=True, axis=1)

In [168]:
df2

        Item Purchased  Cost
Store 3      Bird Seed   5.0
Store 4   Aston Martin  97.0

## Data loading

In [174]:
df = pd.read_csv('data/olympics.csv', header=0, skiprows=1)
df.head()

,Unnamed: 0,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [177]:
df.columns

Index(['Unnamed: 0', '№ Summer', '01 !', '02 !', '03 !', 'Total', '№ Winter',
       '01 !.1', '02 !.1', '03 !.1', 'Total.1', '№ Games', '01 !.2', '02 !.2',
       '03 !.2', 'Combined total'],
      dtype='object')

In [178]:
for col in df.columns:
    if col[:2]=='01':
        df.rename(columns={col:'Gold' + col[4:]}, inplace=True)
    if col[:2]=='02':
        df.rename(columns={col:'Silver' + col[4:]}, inplace=True)
    if col[:2]=='03':
        df.rename(columns={col:'Bronze' + col[4:]}, inplace=True)
    if col[:1]=='№':
        df.rename(columns={col:'#' + col[1:]}, inplace=True) 

df.columns

Index(['Unnamed: 0', '# Summer', 'Gold', 'Silver', 'Bronze', 'Total',
       '# Winter', 'Gold.1', 'Silver.1', 'Bronze.1', 'Total.1', '# Games',
       'Gold.2', 'Silver.2', 'Bronze.2', 'Combined total'],
      dtype='object')

### Alles in een list-comprehension

In [180]:
l = ['Gold','Silver','Bronze']
[l[int(x[:2])-1]+x[4:] for x in df.columns if x[:2] in ['01','02','03']]

[]

## Querying a DataFrame

In [183]:
df

,Unnamed: 0,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
142,Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
143,Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
144,Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
145,Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
146,Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

In [190]:
only_gold = df.where(df['Gold']>0)
only_gold.dropna(inplace=True)
only_gold.head()

,Unnamed: 0,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
1,Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
2,Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
3,Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
4,Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0
5,Australia (AUS) [AUS] [Z],25.0,139.0,152.0,177.0,468.0,18.0,5.0,3.0,4.0,12.0,43.0,144.0,155.0,181.0,480.0

In [199]:
len(df.where((df['Gold']>0) & (df['Gold.1']>0)).dropna()['Unnamed: 0'].unique())

37